# Pandas Walkthrough

In [5]:
# We need to import Pandas & Numpy
import pandas as pd # pd is the alias
import numpy as np #np is the alias

### Basic forms -> Serie & Dataframe

In [8]:
my_serie = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
my_serie

a    1.403166
b   -0.236922
c    1.850900
d    0.149697
e   -0.549193
dtype: float64

In [20]:
my_dataframe = pd.DataFrame({
    'Name': ['Andres', 'Melissa', 'Freddy'],
    'Lastname': ['Gutierrez', 'Cardenas', 'Vega'],
    'Age': [23, 22, 35],
})
display(my_dataframe)

      Name   Lastname  Age
0   Andres  Gutierrez   23
1  Melissa   Cardenas   22
2   Freddy       Vega   35

In [21]:
my_dataframe['Name']

0     Andres
1    Melissa
2     Freddy
Name: Name, dtype: object

In [23]:
my_dataframe.Name # danger!

0     Andres
1    Melissa
2     Freddy
Name: Name, dtype: object

#### Simple query

In [25]:
my_dataframe[my_dataframe['Name'] == 'Andres']

     Name   Lastname  Age
0  Andres  Gutierrez   23

In [26]:
mask = [True, False, False]

In [27]:
my_dataframe[mask]

     Name   Lastname  Age
0  Andres  Gutierrez   23

### Read external file

In [32]:
pokemon = pd.read_excel('pokemon.xlsx', sheet_name='Pokemon')
pokemon.head()

,#,Name,Type,Total,HP,Attack,Defense,Special Attack,Special Defense,Speed
0,001,Bulbasaur,GRASS,318,45,49,49,65,65,45
1,001,Bulbasaur,POISON,318,45,49,49,65,65,45
2,002,Ivysaur,GRASS,405,60,62,63,80,80,60
3,002,Ivysaur,POISON,405,60,62,63,80,80,60
4,003,Venusaur,GRASS,525,80,82,83,100,100,80

In [34]:
pokemon_moves = pd.read_excel('pokemon.xlsx', sheet_name='Moves')
pokemon_moves.head()

,Name,Type,Cat.,Power,Acc.,PP,TM,Effect,Prob. (%)
0,Absorb,GRASS,Special,20.0,100,25.0,NaN,User recovers half the HP inflicted on opponent.,NaN
1,Acid,POISON,Special,40.0,100,30.0,NaN,May lower opponent's Special Defense.,10.0
2,Acid Armor,POISON,Status,NaN,NaN,40.0,NaN,Sharply raises user's Defense.,NaN
3,Acid Spray,POISON,Special,40.0,100,20.0,NaN,Sharply lowers opponent's Special Defense.,100.0
4,Acrobatics,FLYING,Physical,55.0,100,15.0,TM62,Stronger when the user does not have a held item.,NaN

In [36]:
pokemon_evolution = pd.read_excel('pokemon.xlsx', sheet_name='Evolution')
pokemon_evolution.head()

  Evolving from Evolving to  Level Condition Evolution Type
0     Bulbasaur     Ivysaur   16.0       NaN          Level
1       Ivysaur    Venusaur   32.0       NaN          Level
2    Charmander  Charmeleon   16.0       NaN          Level
3    Charmeleon   Charizard   36.0       NaN          Level
4      Squirtle   Wartortle   16.0       NaN          Level

## Applying merge

In [40]:
merged_pokemon = pokemon.merge(pokemon_evolution, left_on=['Name'], right_on=['Evolving from'])
merged_pokemon.head()

,#,Name,Type,Total,HP,Attack,Defense,Special Attack,Special Defense,Speed,Evolving from,Evolving to,Level,Condition,Evolution Type
0,001,Bulbasaur,GRASS,318,45,49,49,65,65,45,Bulbasaur,Ivysaur,16.0,NaN,Level
1,001,Bulbasaur,POISON,318,45,49,49,65,65,45,Bulbasaur,Ivysaur,16.0,NaN,Level
2,002,Ivysaur,GRASS,405,60,62,63,80,80,60,Ivysaur,Venusaur,32.0,NaN,Level
3,002,Ivysaur,POISON,405,60,62,63,80,80,60,Ivysaur,Venusaur,32.0,NaN,Level
4,004,Charmander,FIRE,309,39,52,43,60,50,65,Charmander,Charmeleon,16.0,NaN,Level

## Get all types by Pokemon

In [42]:
merged_pokemon[merged_pokemon['Name']=='Bulbasaur']['Type']

0     GRASS
1    POISON
Name: Type, dtype: object

In [46]:
merged_pokemon.groupby(by=['Name']).mean()

,Total,HP,Attack,Defense,Special Attack,Special Defense,Speed,Level
Name,,,,,,,,
Abra,310,25,20,15,105,55,90,16.0
Aipom,360,55,70,55,40,55,85,NaN
Amaura,362,77,59,50,67,63,46,39.0
Anorith,355,45,95,50,40,50,75,40.0
Archen,401,55,112,45,74,45,70,37.0
...,...,...,...,...,...,...,...,...
Yanma,390,65,65,45,75,45,95,NaN
Zigzagoon,240,38,30,41,30,41,60,20.0
Zorua,330,40,65,40,80,40,65,30.0
Zubat,245,40,45,35,30,40,55,22.0
Zweilous,420,72,85,70,65,70,58,64.0